#!/usr/local/python3.5/bin
# -*-  coding:utf-8 -*-

dic = {
	"植物": {
		"草本植物": ["牵牛花", "瓜叶菊", "葫芦", "翠菊", "冬小麦", "甜菜"],
		"木本植物": ["乔木", "灌木", "半灌木", "如松", "衫", "樟"],
		"水生植物": ["荷花", "千屈菜", "菖蒲", "黄菖蒲", "水葱", "再力花", "梭鱼草"]
	},
	"动物": {
		"两栖动物": ["山龟", "山鳖", "石蛙", "娃娃鱼", "蟾蜍", "龟", "鳄鱼", "蜥蜴", "蛇"],
		"禽类": ["稚鸡", "原鸡", "长鸣鸡", "昌国鸡", "斗鸡", "长尾鸡", "乌骨鸡"],
		"哺乳类动物": ["虎", "狼", "鼠", "鹿", "貂", "猴", "貘", "树懒", "斑马", "狗"]
	}
}

# print(dic["植物"]["草本植物"][0])

# 遍历
for key1 in dic.keys():
	for key2 in dic[key1].keys():
		for value in dic[key1][key2]:
			print(value, " ", )
		print("**********")
	print("##########")
